{
    "base": {
        "browser": "Discord iOS",
        "UUIDv4": "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx-AniTrack",
        "error": {
            "mongoDBnoConnection": "Error, we'll fix it as soon as possible, https://uptime.anitrack.co/"
        },
        "maintenance": {
            "message": "We are very sorry for this inconvenience, currently all of the services are locked and unavailable due to Maintenance... Meanwhile we will keep you informed at https://uptime.anitrack.co/ please be patient",
            "response": "Error, 403 The service is on maintenance"
        },
        "embed": {
            "icon": "https://cdn.discordapp.com/attachments/896140694127779840/939850932202663946/LogoPG.png",
            "footer": {
                "def": "© 2021-2022 AniTrack, All Rights Reserved.",
                "credit": "© 2021-2022 AniTrack, All Rights Reserved."
            },
            "colors": {
                "BYPASS": "#f03970",
                "PT1": "#f8f0a2",
                "PT2": "#FFCF71",
                "FREE": "#8dd2e7",
                "def": "#8dd2e7",
                "critical": "#bb2124",
                "warning": "#f0ad4e",
                "success": "#22bb33",
                "purple": "#BB6AF2",
                "orange": "#F39B4A",
                "lightRed": "#F3684A"
            }
        },
        "emojis": {
            "sad": [
                "(つ﹏<)･ﾟ｡",
                "｡：ﾟ(｡ﾉω＼｡)ﾟ･｡",
                "˚‧º·(˚ ˃̣̣̥᷄⌓˂̣̣̥᷅ )‧º·˚",
                "๐·°(৹˃̵﹏˂̵৹)°·๐",
                "‧º·(˚ ˃̣̣̥⌓˂̣̣̥ )‧º·˚",
                "｡:ﾟ(;´∩\\`;)ﾟ:｡",
                "｡ﾟ･（>﹏<）･ﾟ｡",
                "๐·°(৹˃̵﹏˂̵৹)°·๐"
            ],
            "happy": ["≧◡≦", "(●´ω｀●)", "o(^▽^)o", "(•◡•)/", "（=´∇｀=）"],
            "confuse": [
                "(・_・ヾ",
                "｢(ﾟﾍﾟ)",
                "「(°ヘ°)",
                "(・・)",
                "(・・",
                "(。ヘ°)",
                "(´−｀) ﾝｰ"
            ]
        }
    },
    "en": {
        "tooFast": "Please wait and select one of the search result before sending the command.",
        "permission": {
            "error": {
                "notAdministrator": "❌ Sorry, But this command you need to have **MANAGE SERVER** or **ADMINISTRATOR** role privileges in order to use it",
                "noPremium": "❌ Sorry, But this server needs to have a Patreon tier 2 subscription in order to use this command!",
                "notOwner": "❌ Sorry, But you are not allowed to use this command. Only server owner are allowed to use this command."
            }
        },
        "embed": {
            "error": {
                "noImage": "https://cdn.discordapp.com/attachments/896140694127779840/896140811056590918/133965-spTi0WE7jR0r.png",
                "noYouTube": "https://google.com",
                "list": {
                    "noNotifyRoom": "⚠ Oops, Looks like this server is not yet setup. Please use command `/anime admin setchannel [SelectedChannel]` to continue using the bot!\n\n||Or this might have happened because the bot itself lost its permission to send messages or the NotifyChannel has been deleted. Don't worry the anime & notify list still stays the same and has not been deleted||",
                    "noAnime": "⚠ Oops, Looks like this server doesn't have any Anime added to the tracking list. Please add them by using `/anime add [AnimeID or Romaji/English Name] [Anime Nickname]`... Note! If you are confused or lost about the commands you can visit the NotifyChannel and read the Bot's help message for more information you can type slash to see all documented commands.",
                    "noSubscribe": "⚠ Oops, Looks like you haven't subscribe to any of the Anime in the tracking list yet, you can subscribe to them by using `/anime subscribe [Anime Nickname]` or unsubscribe with `/anime unsubscribe [AnimeNickname]`"
                }
            },
            "response": {
                "list": {
                    "successList": ":pencil:  This Server's Anime list"
                }
            }
        },
        "interaction": {
            "realTimeQuery": {
                "error": {
                    "noNotify": "No notify channel, Please create one /anime admin setchannel",
                    "noPermission": "No role permission. Please contact this server administrator",
                    "tooLong": "The query is too long, please try again with a shorter one"
                },
                "add": {
                    "error": {
                        "IDtooLong": "This ID does not fit the Anilist criteria, please try again.",
                        "AlreadyAiredID": "This Anime has already been aired, Please search for Airing or Not Yet Aired Anime.",
                        "IDnoExist": "This ID does not exist, please try another.",
                        "notFound": "Can not find anime with this exact name! Or the anime has already aired... Please try another."
                    }
                }
            },
            "setChannel": {
                "error": {
                    "missingPermissionSendMessage": "Something has gone wrong while trying to add the channel... Maybe missing permissions on target channel to send or view channel `View Channels` `Send Messages`? Please check the Bot's permission and try again later",
                    "missingPermissionCreateWebhook": "Something has gone wrong while trying to add the channel... Maybe missing permissions on target channel to create a webhook `Manage Webhooks`? Please check the Bot's permission and try again later",
                    "tooMuchWebhook": "Something has gone wrong while trying to add the channel... Maybe too much Webhooks has been created for target Channel or Server? Please try to delete some of them then try again later",
                    "alreadySet": "Sorry, but Looks like there's already a NotifyChannel setup... If you wish to remove please use `/anime admin removechannel`, don't worry as this won't reset your anime or notify list",
                    "fishy": "<:fishy:964129009057280020>  **Oops, looks like something very fishy is going on .-.**\n\nMaybe you're trying to get a larger Anime List by setting up a multiple servers or you might forgot to disable/remove notifyChannel before deleting the previous Discord Server?\n\nIf so, please mass disable AniTrack Bot on every servers you owned with `/debug \"Server Owner | Disable NotifyChannel on every servers I owned\"` Don't worry! Nothing will be deleted. You just have to manually setup the notifyChannel on each server your owned again."
                },
                "response": {
                    "replySetA": "Successfully set channel & created a webhook for",
                    "replySetB": "You may start using the Bot now!\n\n> ⚠️ ||Please keep in mind that you will need to remove webhook manually if you kick the Bot out without removing the channel.\n> So please make sure that you've use `/anime admin removechannel` before kicking the Bot out for easier process! Thanks.||",
                    "removedChannel": ":pushpin: Successfully removed the NotifyChannel!\n\n> ⚠️ ||Please kindly delete the unused webhook manually if you'd like to.\n> As the Bot itself cannot delete the webhook by itself but the bot will ignore and no longer send updates to that webhook anymore||"
                }
            },
            "anime": {
                "error": {
                    "existedAnimeID": {
                        "front": "Sorry, but this Anime ID",
                        "back": "is already on the list. You can always remove this Anime by using `/anime remove [AnimeNickname]`"
                    },
                    "existedNickname": {
                        "front": "Sorry, but this Nickname",
                        "back": "is already on the list, please try another Anime Nickname"
                    },
                    "invalidID": {
                        "front": "Sorry, but this Anime ID",
                        "back": "doesn't seem to be valid, please check the Anime ID or Name again"
                    },
                    "isFinished": {
                        "front": "Sorry, but",
                        "back": "has already finished airing"
                    },
                    "isCancelled": {
                        "front": "Sorry, but",
                        "back": "has been cancelled"
                    },
                    "isDelayed": {
                        "front": "Sorry, but",
                        "back": "has been delayed and will have a new airing schedule soon or later..."
                    },
                    "badFormat": "Sorry, but this Anime have a really weird formatting and we are unable to process this Anime. If you believe this is a bug please report it in <https://AniTrack.co/discord> Bug report channel <:fear:899011066879696896>",
                    "limitA": "Sorry, but this server has reached it maximum free tier limit of",
                    "limitB": "Animes. However you can choose to remove some Anime or support us at <https://anitrack.co/patreon> to extend the Anime list limit and unlocks many other features! We appreciate every single donation, Thank you <3",
                    "premiumLimitA": "Sorry, but looks like this server has reached the maximum Patreon tier limit of",
                    "premiumLimitB": "Anime. Thank you for supporting us <3!",
                    "noRole": "Sorry, but looks like you don't have a required role in order to use this command. If you believe this is a mistake please contact the server's administrator or manager to solve the problem",
                    "noNSFW": "Sorry, but this Guild needs to have Patreon tier 2 (PT2) subscription in order to add NSFW/18+ content"
                },
                "response": {
                    "added": "Successfully added this Anime!"
                }
            },
            "analytics": {
                "response": {
                    "add10": "🎉 Top 10 Anime That Has Been Added The Most",
                    "sub10": "🎉 Top 10 Anime that has been subscribed to the most",
                    "ran10": "🎨 Random Anime"
                }
            },
            "subscribe": {
                "error": {
                    "noAnime": "Oops, looks like you're inputting the wrong [AnimeNickname] for that Anime. Please try again",
                    "alreadySubscribe": "Oops, looks like you already subscribed to this Anime! you can always unsubscribe by `/anime unsubscribe [AnimeNickname]`",
                    "reachLimit": "Oops, looks like this anime on this server has reached it maximum member subscribe per anime limit of"
                },
                "response": {
                    "subscribed": ":bell:  You will now get a notification ping from this Anime when a new episode is aired"
                }
            },
            "unsubscribe": {
                "error": {
                    "noAnime": "Oops, looks like you're inputting the wrong Nickname for that Anime!",
                    "noSubscribe": "Oops, looks like you haven't subscribed to this Anime yet! you can do it by `/anime subscribe [AnimeNickname]`"
                },
                "response": {
                    "unsubscribed": ":no_bell:  You will no longer get any notification ping from this Anime"
                }
            },
            "remove": {
                "error": {
                    "notExist": "This Anime doesn't seem to exist"
                },
                "response": {
                    "removed": "Successfully removed this Anime from the list"
                }
            },
            "help": "<https://anitrack.co/help> **- \"Section 02 Bot | Command List\"**\nCommand help & Explain will be displayed once you type out the command in Discord",
            "button": {
                "notify": {
                    "error": {
                        "gotDeleted": "This Anime does not exist in the list"
                    },
                    "response": {
                        "select": "** **",
                        "on": ":bell:  You will now get a notification ping from this Anime when the new episode is aired",
                        "off": ":no_bell:  You will no longer get any notification ping from this Anime"
                    }
                }
            }
        }
    }
}
